app/Controllers/AdminController.php

    public function index(){
        $user= new Users();
        $data['user']=$user->findAll();
---
SELECT *
FROM `users`