app/Controllers/UserController.php

SELECT *
FROM `users`
WHERE `Telephone` = '0331725331'
 LIMIT 1
---
        public function login(){
            $user= new Users();

            $telephone= $this->request->getPost('telephone');
            $mdp= $this->request->getPost('password');

            $result=$user->where('Telephone',$telephone)->first();

SELECT *
FROM `users`
WHERE `Telephone` = '0349755572'
 LIMIT 1
---
        public function faireRetrait(){
            $user = new Users();


        $montant= $this->request->getPost('montant');
        $telephone= $this->request->getPost('telephone');
        $password = $this->request->getPost('password');





        $result=$user->where('Telephone',$telephone)->first();